#include<iostream>  
#include <fstream> 
#include<stdio.h>                 //C语言标准输入输出头文件
#include<stdlib.h>                //文件操作需要用到的头文件
#include<string.h>                // 2
#include <iomanip>
#include "Lesson_inf.h"
#include "Teacher_inf.h"
#include "Student_inf.h"
#include "allclass.h"
using namespace std;   

void allclass::mainfun ()
{
	while(1)
	{
    system("cls");                         //清屏  
	cout<<"--------------------------------------------------------------------------------------------------------------------------\n";
    cout<<"----------------------------------------------< 学 生 选 课 系 统 >-------------------------------------------------------\n";
    cout<<"--------------------------------------------------------------------------------------------------------------------------\n";
    cout<<"-------------------------------------------        1.教师登录        -----------------------------------------------------\n";
    cout<<"-------------------------------------------        2.学生登录        -----------------------------------------------------\n";
    cout<<"-------------------------------------------        3.退出系统        -----------------------------------------------------\n";
	cout<<"-------------------------------------------------------------------------------- [ Made By 生医1601班冯敏 ] --------------\n";
	cout<<"--------------------------------------------------------------------------------------------------------------------------\n";
    cout<<" 请输入相应的功能序号:";
    int choose;
    cin>>choose;
    switch(choose)   //switch语句选择执行功能
    {
        case 1:		  
	      system("cls");
		   laoshi.teacherRegisteration();
		   laoshi.allfunction();
		   break; 
        case 2:
			xuesheng.stuRegisteration();
			xuesheng.allfunctionS();
	        system("cls"); 
			break; 
		  	case 3:
			system("cls"); 
			kecheng.over ();
	        exit(0); 
			break;
}
}

}